Revit 2024 API
FabricationPart.RemovePartCustomData Method
 Remove custom data from the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool RemovePartCustomData(
	int customId
)
Visual Basic
Public Function RemovePartCustomData ( _
	customId As Integer _
) As Boolean
Visual C++
public:
bool RemovePartCustomData(
	int customId
)
Parameters
customId
Type: System.Int32
 The identifier of the custom data field to remove.
Return Value
 Returns true if the type was found and removed. The type will not be removed if it is not an optional type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The custom data does not exist on the part.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace